case_cylinder_kOmega/0.default/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 440.15;

boundaryField
{
    inlet		// will be overwritten when mapping is performed
    {
        type            fixedValue;
        value           uniform 99999;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            slip;
    }


    bottom
    {
        type            epsilonWallFunction;		// wall function (!)
        value           uniform 0.000765;
    }

    roughCylinder
    {
        type            epsilonWallFunction;		// wall function (!)
        value           uniform 0.000765;
    }

    sideWall
    {
        type            epsilonWallFunction;		// wall function (!)
        value           uniform 0.000765;
    }

    
}


// ************************************************************************* //
